# Value Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IntegerParameterValue..::..Value Property
IntegerParameterValue Class See Also
---
The stored value
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public int Value { get; set; }
```

Visual Basic
---
```text
Public Property Value As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int Value {
	int get ();
	void set (int value);
}
```

# See Also
IntegerParameterValue Class
Autodesk.Revit.DB Namespace